#include <stdio.h>

void draw(int n);

int main(void)
{
    draw(4);
}

void draw(int n)
{
    // first here the base case; if nothing to draw -> stop
    if(n <= 0)
    return;
    // print a pyramid of height n - 1
    draw(n-1);
    // print one more row
    for (int i = 0; i < n; i++)
    {
        printf("#");
    }
    printf("\n");
}

/**
 * العود: 
 * دالة ارسم هرم من ٤ مستويات:
 * ندخل الدالة فنسأل هل ن أقل من أو يساوي صفر -> لأ؟ طب تمام يلا بينا
 * هلاقيه بيقول ارسم هرم ن -١ فهقوله حاضر نوقف اللي فاتت دقيقة نعمل الثانية ونرجعلها
 * تمام يلا بينا للثانية نرسم ن - ١ هلاقي الشرط في الأول فهيعديني هلاقيه بيقولي ارسم ن-١
 * هقوله تمام نوقف الثانية كمان دقايق كده نخلص التالتة ونرجع
 * التالتة داخل ب ٢ هلاقيه بيقولي ارسم ن - ١ هوقف التالتة وأدخل الرابعة
 * داخل الرابعة ب ١ هلاقي ارسم - ١ رقم خمسة هقوله حاضر
 * الخامسة داخل ب ٠ لكن هنا الشرط هيوقفني فهرجع للرابعة
 * الرابعة ن = ١ هكمل الدالة واطبع هاش لحد ما آي تبقى قد ن يعني واحدة بس وانزل سطر
 * وأخرج للثالثة اللي ن = ٢ فهرسم اتنين هاش ونزل سطر
 * وأخرج للتانية اللي ن = ٣ فهرسم تلاتة هاشر وانزل سطر
 * وأخرج للأولى اللي ن = ٤ فهرسم ٤ هاش وانزل سطر 
 * وأخرج من الدالة
*/